backend/experiment_results/ab_test_result1.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /warnings/1
Document Length:        537 bytes

Concurrency Level:      10
Time taken for tests:   0.113 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      661000 bytes
HTML transferred:       537000 bytes
Requests per second:    8855.12 [#/sec] (mean)
Time per request:       1.129 [ms] (mean)
Time per request:       0.113 [ms] (mean, across all concurrent requests)
Transfer rate:          5716.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    1   0.4      1       3
Waiting:        0    1   0.4      1       3
Total:          0    1   0.5      1       3

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      2
  98%      2
  99%      3
 100%      3 (longest request)