backend/experiment_results/ab_test_result2.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /warnings/1
Document Length:        537 bytes

Concurrency Level:      10
Time taken for tests:   0.158 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      661000 bytes
HTML transferred:       537000 bytes
Requests per second:    6324.83 [#/sec] (mean)
Time per request:       1.581 [ms] (mean)
Time per request:       0.158 [ms] (mean, across all concurrent requests)
Transfer rate:          4082.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     0    1   0.7      1       9
Waiting:        0    1   0.6      1       6
Total:          0    2   0.7      1       9
WARNING: The median and mean for the total time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      2
  90%      2
  95%      3
  98%      3
  99%      4
 100%      9 (longest request)